betfair/templates/global/BFGlobalService.submitLIMBMessage.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/global/v3/'
xmlns:ns1='http://www.betfair.com/publicapi/v3/BFGlobalService/'>
<SOAP-ENV:Body>
<ns1:submitLIMBMessage>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<password></password>
<submitPersonalMessage>
<messageId>0</messageId>
<acknowledgment></acknowledgment>
</submitPersonalMessage>
<submitTCPrivacyPolicyChangeMessage>
<tCPrivacyPolicyChangeAcceptance>NO_REPLY</tCPrivacyPolicyChangeAcceptance>
</submitTCPrivacyPolicyChangeMessage>
<submitPasswordChangeMessage>
<messageId>0</messageId>
<newPassword></newPassword>
<newPasswordRepeat></newPasswordRepeat>
</submitPasswordChangeMessage>
<submitBirthDateCheckMessage>
<messageId>0</messageId>
<detailsCorrect></detailsCorrect>
<correctBirthDate>2012-05-16T18:47:04Z</correctBirthDate>
</submitBirthDateCheckMessage>
<submitAddressCheckMessage>
<messageId>0</messageId>
<detailsCorrect></detailsCorrect>
<newAddress1></newAddress1>
<newAddress2></newAddress2>
<newAddress3></newAddress3>
<newTown></newTown>
<newCounty></newCounty>
<newZipCode></newZipCode>
<newCountry></newCountry>
</submitAddressCheckMessage>
<submitContactDetailsCheckMessage>
<messageId>0</messageId>
<detailsCorrect></detailsCorrect>
<newHomeTelephone></newHomeTelephone>
<newWorkTelephone></newWorkTelephone>
<newMobileTelephone></newMobileTelephone>
<newEmailAddress></newEmailAddress>
</submitContactDetailsCheckMessage>
<submitChatNameChangeMessage>
<messageId>0</messageId>
<newChatName></newChatName>
</submitChatNameChangeMessage>
<submitCardBillingAddressCheckItems>
<ns2:submitCardBillingAddressCheckLIMBMessage>
<messageId>0</messageId>
<detailsCorrect></detailsCorrect>
<nickName></nickName>
<newAddress1></newAddress1>
<newAddress2></newAddress2>
<newAddress3></newAddress3>
<newTown></newTown>
<newCounty></newCounty>
<newZipCode></newZipCode>
<newCountry></newCountry>
</ns2:submitCardBillingAddressCheckLIMBMessage>
<ns2:submitCardBillingAddressCheckLIMBMessage>
<messageId>0</messageId>
<detailsCorrect></detailsCorrect>
<nickName></nickName>
<newAddress1></newAddress1>
<newAddress2></newAddress2>
<newAddress3></newAddress3>
<newTown></newTown>
<newCounty></newCounty>
<newZipCode></newZipCode>
<newCountry></newCountry>
</ns2:submitCardBillingAddressCheckLIMBMessage>
<ns2:submitCardBillingAddressCheckLIMBMessage>
<messageId>0</messageId>
<detailsCorrect></detailsCorrect>
<nickName></nickName>
<newAddress1></newAddress1>
<newAddress2></newAddress2>
<newAddress3></newAddress3>
<newTown></newTown>
<newCounty></newCounty>
<newZipCode></newZipCode>
<newCountry></newCountry>
</ns2:submitCardBillingAddressCheckLIMBMessage>
</submitCardBillingAddressCheckItems>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:submitLIMBMessage>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
